app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at", "user_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save